Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_fdcan2.h
#define FDCAN2_TXBAR_AR         (0xFFFFFFFFU<<0)
#define FDCAN2_TXBAR_AR_0       (0x1U<<0)

// TXBCR Configuration

#define FDCAN2_TXBCR_CR         (0xFFFFFFFFU<<0)
#define FDCAN2_TXBCR_CR_0       (0x1U<<0)

// TXBTO Configuration

#define FDCAN2_TXBTO_TO         (0xFFFFFFFFU<<0)
#define FDCAN2_TXBTO_TO_0       (0x1U<<0)

// TXBCF Configuration

#define FDCAN2_TXBCF_CF         (0xFFFFFFFFU<<0)
#define FDCAN2_TXBCF_CF_0       (0x1U<<0)

// TXBTIE Configuration

#define FDCAN2_TXBTIE_TIE       (0xFFFFFFFFU<<0)
#define FDCAN2_TXBTIE_TIE_0     (0x1U<<0)

// TXBCIE Configuration

#define FDCAN2_TXBCIE_CF        (0xFFFFFFFFU<<0)
#define FDCAN2_TXBCIE_CF_0      (0x1U<<0)

// TXEFC Configuration

#define FDCAN2_TXEFC_EFWM       (0x3FU<<24)
#define FDCAN2_TXEFC_EFWM_0     (0x1U<<24)
#define FDCAN2_TXEFC_EFS        (0x3FU<<16)
#define FDCAN2_TXEFC_EFS_0      (0x1U<<16)
#define FDCAN2_TXEFC_EFSA       (0x3FFFU<<2)
#define FDCAN2_TXEFC_EFSA_0     (0x1U<<2)

// TXEFS Configuration

#define FDCAN2_TXEFS_TEFL       (0x1U<<25)
#define FDCAN2_TXEFS_EFF        (0x1U<<24)
#define FDCAN2_TXEFS_EFPI       (0x1FU<<16)
#define FDCAN2_TXEFS_EFPI_0     (0x1U<<16)
#define FDCAN2_TXEFS_EFGI       (0x1FU<<8)
#define FDCAN2_TXEFS_EFGI_0     (0x1U<<8)
#define FDCAN2_TXEFS_EFFL       (0x3FU<<0)
#define FDCAN2_TXEFS_EFFL_0     (0x1U<<0)

// TXEFA Configuration

#define FDCAN2_TXEFA_EFAI       (0x1FU<<0)
#define FDCAN2_TXEFA_EFAI_0     (0x1U<<0)

// TTTMC Configuration

#define FDCAN2_TTTMC_TME        (0x7FU<<16)
#define FDCAN2_TTTMC_TME_0      (0x1U<<16)
#define FDCAN2_TTTMC_TMSA       (0x3FFFU<<2)
#define FDCAN2_TTTMC_TMSA_0     (0x1U<<2)

// TTRMC Configuration

#define FDCAN2_TTRMC_RMPS       (0x1U<<31)
#define FDCAN2_TTRMC_XTD        (0x1U<<30)
#define FDCAN2_TTRMC_RID        (0x1FFFFFFFU<<0)
#define FDCAN2_TTRMC_RID_0      (0x1U<<0)

// TTOCF Configuration

#define FDCAN2_TTOCF_EVTP       (0x1U<<26)
#define FDCAN2_TTOCF_ECC        (0x1U<<25)
#define FDCAN2_TTOCF_EGTF       (0x1U<<24)
#define FDCAN2_TTOCF_AWL        (0xFFU<<16)
#define FDCAN2_TTOCF_AWL_0      (0x1U<<16)
#define FDCAN2_TTOCF_EECS       (0x1U<<15)
#define FDCAN2_TTOCF_IRTO       (0x7FU<<8)
#define FDCAN2_TTOCF_IRTO_0     (0x1U<<8)
#define FDCAN2_TTOCF_LDSDL      (0x7U<<5)
#define FDCAN2_TTOCF_LDSDL_0    (0x1U<<5)
#define FDCAN2_TTOCF_TM         (0x1U<<4)
#define FDCAN2_TTOCF_GEN        (0x1U<<3)
#define FDCAN2_TTOCF_OM         (0x3U<<0)
#define FDCAN2_TTOCF_OM_0       (0x1U<<0)

// TTMLM Configuration

#define FDCAN2_TTMLM_ENTT       (0xFFFU<<16)
#define FDCAN2_TTMLM_ENTT_0     (0x1U<<16)
#define FDCAN2_TTMLM_TXEW       (0xFU<<8)
#define FDCAN2_TTMLM_TXEW_0     (0x1U<<8)
#define FDCAN2_TTMLM_CSS        (0x3U<<6)
#define FDCAN2_TTMLM_CSS_0      (0x1U<<6)
#define FDCAN2_TTMLM_CCM        (0x3FU<<0)
#define FDCAN2_TTMLM_CCM_0      (0x1U<<0)

// TURCF Configuration

#define FDCAN2_TURCF_ELT        (0x1U<<31)
#define FDCAN2_TURCF_DC         (0x3FFFU<<16)
#define FDCAN2_TURCF_DC_0       (0x1U<<16)
#define FDCAN2_TURCF_NCL        (0xFFFFU<<0)
#define FDCAN2_TURCF_NCL_0      (0x1U<<0)

// TTOCN Configuration

#define FDCAN2_TTOCN_LCKC       (0x1U<<15)
#define FDCAN2_TTOCN_ESCN       (0x1U<<13)
#define FDCAN2_TTOCN_NIG        (0x1U<<12)
#define FDCAN2_TTOCN_TMG        (0x1U<<11)
#define FDCAN2_TTOCN_FGP        (0x1U<<10)
#define FDCAN2_TTOCN_GCS        (0x1U<<9)
#define FDCAN2_TTOCN_TTIE       (0x1U<<8)
#define FDCAN2_TTOCN_TMC        (0x3U<<6)
#define FDCAN2_TTOCN_TMC_0      (0x1U<<6)
#define FDCAN2_TTOCN_RTIE       (0x1U<<5)
#define FDCAN2_TTOCN_SWS        (0x3U<<3)
#define FDCAN2_TTOCN_SWS_0      (0x1U<<3)
#define FDCAN2_TTOCN_SWP        (0x1U<<2)
#define FDCAN2_TTOCN_ECS        (0x1U<<1)
#define FDCAN2_TTOCN_SGT        (0x1U<<0)

// CAN_TTGTP Configuration

#define FDCAN2_CAN_TTGTP_CTP    (0xFFFFU<<16)
#define FDCAN2_CAN_TTGTP_CTP_0  (0x1U<<16)
#define FDCAN2_CAN_TTGTP_NCL    (0xFFFFU<<0)
#define FDCAN2_CAN_TTGTP_NCL_0  (0x1U<<0)

// TTTMK Configuration

#define FDCAN2_TTTMK_LCKM       (0x1U<<31)
#define FDCAN2_TTTMK_TICC       (0x7FU<<16)
#define FDCAN2_TTTMK_TICC_0     (0x1U<<16)
#define FDCAN2_TTTMK_TM         (0xFFFFU<<0)
#define FDCAN2_TTTMK_TM_0       (0x1U<<0)

// TTIR Configuration

#define FDCAN2_TTIR_CER         (0x1U<<18)
#define FDCAN2_TTIR_AW          (0x1U<<17)
#define FDCAN2_TTIR_WT          (0x1U<<16)
#define FDCAN2_TTIR_IWTG        (0x1U<<15)
#define FDCAN2_TTIR_ELC         (0x1U<<14)
#define FDCAN2_TTIR_SE2         (0x1U<<13)
#define FDCAN2_TTIR_SE1         (0x1U<<12)
#define FDCAN2_TTIR_TXO         (0x1U<<11)
#define FDCAN2_TTIR_TXU         (0x1U<<10)
#define FDCAN2_TTIR_GTE         (0x1U<<9)
#define FDCAN2_TTIR_GTD         (0x1U<<8)
#define FDCAN2_TTIR_GTW         (0x1U<<7)
#define FDCAN2_TTIR_SWE         (0x1U<<6)
#define FDCAN2_TTIR_TTMI        (0x1U<<5)
#define FDCAN2_TTIR_RTMI        (0x1U<<4)
#define FDCAN2_TTIR_SOG         (0x1U<<3)
#define FDCAN2_TTIR_CSM         (0x1U<<2)
#define FDCAN2_TTIR_SMC         (0x1U<<1)
#define FDCAN2_TTIR_SBC         (0x1U<<0)

// TTIE Configuration

#define FDCAN2_TTIE_CERE        (0x1U<<18)
#define FDCAN2_TTIE_AWE         (0x1U<<17)
#define FDCAN2_TTIE_WTE         (0x1U<<16)
#define FDCAN2_TTIE_IWTGE       (0x1U<<15)
#define FDCAN2_TTIE_ELCE        (0x1U<<14)
#define FDCAN2_TTIE_SE2E        (0x1U<<13)
#define FDCAN2_TTIE_SE1E        (0x1U<<12)
#define FDCAN2_TTIE_TXOE        (0x1U<<11)
#define FDCAN2_TTIE_TXUE        (0x1U<<10)
#define FDCAN2_TTIE_GTEE        (0x1U<<9)
#define FDCAN2_TTIE_GTDE        (0x1U<<8)
#define FDCAN2_TTIE_GTWE        (0x1U<<7)
#define FDCAN2_TTIE_SWEE        (0x1U<<6)
#define FDCAN2_TTIE_TTMIE       (0x1U<<5)
#define FDCAN2_TTIE_RTMIE       (0x1U<<4)
#define FDCAN2_TTIE_SOGE        (0x1U<<3)
#define FDCAN2_TTIE_CSME        (0x1U<<2)
#define FDCAN2_TTIE_SMCE        (0x1U<<1)
#define FDCAN2_TTIE_SBCE        (0x1U<<0)

// TTILS Configuration

#define FDCAN2_TTILS_CERL       (0x1U<<18)
#define FDCAN2_TTILS_AWL        (0x1U<<17)
#define FDCAN2_TTILS_WTL        (0x1U<<16)
#define FDCAN2_TTILS_IWTGL      (0x1U<<15)
#define FDCAN2_TTILS_ELCL       (0x1U<<14)
#define FDCAN2_TTILS_SE2L       (0x1U<<13)
#define FDCAN2_TTILS_SE1L       (0x1U<<12)
#define FDCAN2_TTILS_TXOL       (0x1U<<11)
#define FDCAN2_TTILS_TXUL       (0x1U<<10)
#define FDCAN2_TTILS_GTEL       (0x1U<<9)
#define FDCAN2_TTILS_GTDL       (0x1U<<8)
#define FDCAN2_TTILS_GTWL       (0x1U<<7)
#define FDCAN2_TTILS_SWEL       (0x1U<<6)
#define FDCAN2_TTILS_TTMIL      (0x1U<<5)
#define FDCAN2_TTILS_RTMIL      (0x1U<<4)
#define FDCAN2_TTILS_SOGL       (0x1U<<3)
#define FDCAN2_TTILS_CSML       (0x1U<<2)
#define FDCAN2_TTILS_SMCL       (0x1U<<1)
#define FDCAN2_TTILS_SBCL       (0x1U<<0)

// TTOST Configuration

